# St7SetPlateLayers

Sets the number of layers used for MNL integrations through the plate thickness. The default is ten, and a
maximum of 100 layers may be set.

Properties – Beams, Plates and Bricks

long St7SetPlateLayers(long uID, long PropNum, long NumLayers)

Input Parameters

uID

Strand7 model file ID.

PropNum

Plate property number.

NumLayers

Number of integration layers.